import NavBar from "@/components/layout/nav"
import { Card, Container } from "react-bootstrap"
import Head from "next/head"
export default function Terms_and_Conditions() {
    return (
        <>
            <Head>
                <meta charset="UTF-8" />
                <meta name="viewport" content="width=device-width, initial-scale=1.0" />
                <title>Terms and Conditions | บริการให้เช่า Cloud Hosting | Colo VPS Server</title>
                <meta name="description" content="ข้อกำหนดและเงื่อนไขการให้บริการ บริการให้เช่า Cloud Hosting และ Colo VPS Server ของ TCNE" />
                <meta name="keywords" content="TCNE, Cloud Hosting, Colo VPS Server, Terms and Conditions" />
                <meta property="og:title" content="Terms and Conditions | บริการให้เช่า Cloud Hosting | Colo VPS Server" />
                <meta property="og:description" content="ข้อกำหนดและเงื่อนไขการให้บริการ บริการให้เช่า Cloud Hosting และ Colo VPS Server ของ TCNE" />
                <meta property="og:type" content="website" />
                <meta property="og:url" content="https://www.tcne.in.th/terms" />
                <meta property="og:image" content="https://cdn.tcne.in.th/tcne_bbg.jpg" />
                <meta property="og:image:alt" content="TCNE" />
                <meta name="twitter:card" content="summary_large_image" />
                <meta name="twitter:title" content="Terms and Conditions | บริการให้เช่า Cloud Hosting | Colo VPS Server" />
                <meta name="twitter:description" content="ข้อกำหนดและเงื่อนไขการให้บริการ บริการให้เช่า Cloud Hosting และ Colo VPS Server ของ TCNE" />
                <meta name="twitter:image" content="https://cdn.tcne.in.th/tcne_bbg.jpg" />
            </Head>
            <NavBar>
                <div className=" bg-secondary bg-opacity-10">
                    <Container className=" py-5">
                        <Card className=" border-0 shadow-sm rounded-4">
                            <Card.Body>
                                <p className=" fs-3 m-0">
                                    Terms and Conditions
                                </p>
                                <p className="fs-5 m-0">
                                    ข้อตกลงและเงื่อนไขการให้บริการ TCNE
                                </p>
                                <p className=" fs-5 text-wrap " style={{ textIndent: "1.5rem" }}>
                                    โดยผู้ให้บริการ TCNE หรือ Technology Cloud Network Enterprise หมายถึงบริษัทหรือบุคคลที่ให้บริการให้ผู้ใช้บริการใช้งานบริการ Cloud VPS ดังต่อไปนี้
                                </p>

                                <h4>1. การให้บริการ</h4>
                                <p style={{ textIndent: "1.5rem" }}>1.1 ผู้ให้บริการ TCNE จะให้บริการโดยใช้เทคโนโลยี Cloud VPS ให้กับผู้ใช้บริการ โดยจะมีการให้บริการในลักษณะต่างๆ อาทิเช่น การเช่าพื้นที่จัดเก็บข้อมูล การให้บริการโฮสต์เว็บไซต์ การให้บริการ VPS และบริการอื่นๆ ตามที่ผู้ใช้บริการต้องการ</p>
                                <p style={{ textIndent: "1.5rem" }}>1.2 ผู้ให้บริการ TCNE จะให้บริการตามมาตรฐานและข้อกำหนดที่เหมาะสม และมีความปลอดภัยสูงสุดเท่าที่เป็นไปได้</p>
                                <p style={{ textIndent: "1.5rem" }}>1.3 ผู้ให้บริการ TCNE จะให้บริการตามกฏหมายที่เกี่ยวข้องกับการให้บริการ Cloud VPS ในประเทศไทย</p>
                                <h4>2. ค่าบริการ</h4>
                                <p style={{ textIndent: "1.5rem" }}>2.1 ผู้ใช้บริการจะต้องชำระค่าบริการตามเงื่อนไขที่ระบุไว้ในแต่ละแพ็กเกจ</p>
                                <p style={{ textIndent: "1.5rem" }}>2.2 ผู้ใช้บริการต้องชำระค่าบริการให้เป็นประจำตามเงื่อนไขที่ระบุไว้ในแต่ละแพ็กเกจ</p>
                                <h4>3. การใช้บริการ</h4>
                                <p style={{ textIndent: "1.5rem" }}>3.1 ผู้ใช้บริการต้องใช้บริการ Cloud VPS ให้เป็นไปตามข้อตกลงและเงื่อนไขการให้บริการ</p>
                                <p style={{ textIndent: "1.5rem" }}>3.2 ผู้ใช้บริการต้องไม่ทำให้บริการ Cloud VPS ของผู้ให้บริการเกิดค้างหรือเสียหายได้ และต้องไม่ทำการแฮ็กหรือยึดครองบัญชีผู้ใช้บริการของผู้อื่น</p>
                                <p style={{ textIndent: "1.5rem" }}>3.3 ผู้ใช้บริการต้องไม่ทำการกระทำใดๆ ที่ส่งผลต่อการใช้บริการของผู้ใช้บริการอื่น หรือทำให้ผู้อื่นไม่สามารถใช้บริการ Cloud VPS ได้อย่างถูกต้อง</p>
                                <p style={{ textIndent: "1.5rem" }}>3.4 ผู้ใช้บริการต้องไม่นำเนื้อหาที่ผิดกฎหมาย หรือขัดต่อกฎหมายมาร์คหรือลิขสิทธิ์ มาใช้บริการ Cloud VPS</p>
                                <h4>4. การรักษาความปลอดภัย</h4>
                                <p style={{ textIndent: "1.5rem" }}>4.1 ผู้ให้บริการ TCNE จะรักษาความปลอดภัยของบริการโดยใช้เทคโนโลยีและมาตรการที่เหมาะสม</p>
                                <p style={{ textIndent: "1.5rem" }}>4.2 ผู้ใช้บริการต้องรักษาความปลอดภัยของบัญชีผู้ใช้ของตนเอง และไม่ให้ผู้อื่นเข้าถึงบัญชีผู้ใช้ของตนเอง</p>
                                <h4>5. การยกเลิกบริการ</h4>
                                <p style={{ textIndent: "1.5rem" }}>5.1 ผู้ให้บริการ TCNE สามารถยกเลิกบริการได้โดยไม่ต้องแจ้งให้ผู้ใช้บริการทราบล่วงหน้า</p>
                                <p style={{ textIndent: "1.5rem" }}>5.2 ผู้ใช้บริการสามารถยกเลิกบริการได้โดยแจ้งให้ผู้ให้บริการทราบล่วงหน้า โดยใช้ช่องทางที่ผู้ให้บริการกำหนดไว้</p>
                                <h4>6. การปรับปรุงและการแก้ไข</h4>
                                <p style={{ textIndent: "1.5rem" }}>6.1 ผู้ให้บริการ TCNE สามารถปรับปรุงและแก้ไขข้อตกลงและเงื่อนไขการให้บริการได้โดยไม่ต้องแจ้งให้ผู้ให้บริการทราบล่วงหน้า</p>
                                <p style={{ textIndent: "1.5rem" }}>6.2 ผู้ใช้บริการต้องเข้าใจและยอมรับการปรับปรุงและแก้ไขข้อตกลงและเงื่อนไขการให้บริการ</p>
                                <p style={{ textIndent: "1.5rem" }}>6.3 การปรับปรุงและแก้ไขข้อตกลงและเงื่อนไขการให้บริการจะมีผลต่อผู้ใช้บริการเมื่อข้อตกลงและเงื่อนไขใหม่ได้ถูกเผยแพร่บนเว็บไซต์ของผู้ให้บริการ Cloud VPS</p>
                                <h4>7. การเปลี่ยนแปลงราคาและการชำระเงิน</h4>
                                <p style={{ textIndent: "1.5rem" }}>7.1 ผู้ให้บริการ TCNE สามารถเปลี่ยนแปลงราคาและการชำระเงินได้โดยไม่ต้องแจ้งให้ผู้ใช้บริการทราบล่วงหน้า แต่จะต้องไม่ละเมิดสิทธิ์ของผู้ใช้บริการตามกฎหมาย</p>
                                <p style={{ textIndent: "1.5rem" }}>7.2 ผู้ใช้บริการต้องชำระค่าบริการให้ถูกต้องตามเงื่อนไขที่ผู้ให้บริการกำหนดไว้ หากผู้ใช้บริการไม่ชำระค่าบริการตามกำหนด ผู้ให้บริการสามารถระงับบริการได้โดยไม่ต้องแจ้งให้ผู้ใช้บริการทราบล่วงหน้า</p>
                                <h4>8. การลิขสิทธิ์</h4>
                                <p style={{ textIndent: "1.5rem" }}>8.1 เนื้อหาทั้งหมดบน TCNE เป็นทรัพย์สินทางปัญญาของผู้ให้บริการ ผู้ใช้บริการจะไม่ได้รับสิทธิ์ในการถือครองทรัพย์สินทางปัญญาดังกล่าว</p>
                                <p style={{ textIndent: "1.5rem" }}>8.2 ผู้ใช้บริการต้องไม่ละเมิดลิขสิทธิ์ของผู้อื่น หากผู้ใช้บริการละเมิดลิขสิทธิ์ ผู้ให้บริการสามารถระงับบริการและดำเนินการตามกฎหมายต่อผู้ใช้บริการได้</p>
                                <h4>9. ความรับผิดชอบของผู้ใช้บริการ</h4>
                                <p style={{ textIndent: "1.5rem" }}>9.1 ผู้ใช้บริการต้องรับผิดชอบในการเก็บรักษาข้อมูลส่วนบุคคลของตนเองและของผู้ใช้บริการอื่นๆ โดยผู้ใช้บริการต้องไม่เปิดเผยหรือนำข้อมูลส่วนบุคคลของผู้ใช้บริการอื่นๆ ไปใช้โดยไม่ได้รับอนุญาต</p>
                                <p style={{ textIndent: "1.5rem" }}>9.2 ผู้ใช้บริการต้องรับผิดชอบในการใช้บริการอย่างเหมาะสมและไม่ละเมิดสิทธิ์ของผู้อื่น ไม่ใช้บริการเพื่อวัตถุประสงค์ผิดกฎหมายหรือเป็นอันตรายต่อผู้อื่น</p>
                                <h4>10. การยกเลิกการให้บริการ</h4>
                                <p style={{ textIndent: "1.5rem" }}>10.1 ผู้ให้บริการสามารถยกเลิกการให้บริการได้โดยไม่ต้องแจ้งให้ผู้ใช้บริการทราบล่วงหน้าในกรณีที่ผู้ใช้บริการละเมิดข้อตกลงและเงื่อนไขการให้บริการ</p>
                                <p style={{ textIndent: "1.5rem" }}>10.2 ผู้ใช้บริการสามารถยกเลิกการให้บริการได้โดยแจ้งให้ผู้ให้บริการทราบล่วงหน้า และต้องชำระค่าบริการที่ค้างอยู่ก่อนการยกเลิก</p>
                                <h4>11. ความรับผิดชอบของผู้ให้บริการ</h4>
                                <p style={{ textIndent: "1.5rem" }}>11.1 ผู้ให้บริการ TCNE มีความรับผิดชอบต่อผู้ใช้บริการในกรณีที่เกิดความเสียหายต่อผู้ใช้บริการจากความผิดพลาดของระบบ Cloud VPS ของผู้ให้บริการ โดยจะตรวจสอบความเสียหายที่เกิดขึ้นกับผู้ใช้บริการ โดยกรณีที่ผู้ใช้บริการเรียกร้องค่าสินไหมทดแทน ทางเราจะสามรถชำระค่าสินไหมทดแทนได้ไม่เกินจำนวนสามเท่าของราคาที่ผู้ใช้บริการได้รับบริการอยู่ หรือ ทดแทนค่าสินไหมตามดุลยพินิจของเรา</p>
                            </Card.Body>
                        </Card>
                    </Container>

                </div>
            </NavBar>
        </>
    )
}